# Managed by scripts/brewfile-manager.sh.
# Darwin-only packages, including casks and formula overrides.

brew "container"
brew "mint"
brew "xcodegen"
cask "1password"
cask "antigravity"
cask "arc"
cask "capcut"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "codex-app"
cask "comfyui"
cask "discord"
cask "font-plemol-jp-nf"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "homerow"
cask "keycastr"
cask "lm-studio"
cask "monitorcontrol"
cask "ollama-app"
cask "rectangle"
cask "screen-studio"
cask "slack"
cask "tailscale-app"
cask "zoom"
