# Managed by scripts/brewfile-manager.sh.
# Darwin-only packages, including casks and formula overrides.

brew "container"
brew "mint"
brew "schroneko/claude-code-updater/claude-code-updater"
brew "xcodegen"
cask "1password"
cask "1password-cli@beta"
cask "autodesk-fusion"
cask "blender"
cask "claude"
cask "cleanshot"
cask "copilot-cli"
cask "discord"
cask "font-plemol-jp-nf"
cask "google-chrome"
cask "google-drive"
cask "homerow"
cask "lm-studio"
cask "monitorcontrol"
cask "rectangle"
cask "schroneko/cdpclick/cdpclick"
cask "schroneko/exbright/exbright"
cask "schroneko/hithint/hithint"
cask "schroneko/nicevoice-app/nicevoice"
cask "slack"
cask "tailscale-app"
cask "telegram"
cask "zoom"
