tap "aljohri/-"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "modularml/packages"
tap "romkatv/powerlevel10k"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "yt-dlp/taps"
brew "xz"
brew "readline"
brew "python@3.12"
brew "cmake"
brew "coreutils"
brew "deno"
brew "openjdk"
brew "dependency-check"
brew "direnv"
brew "libsamplerate"
brew "libsndfile"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glew"
brew "go"
brew "hatch"
brew "huggingface-cli"
brew "jpeg"
brew "jq"
brew "node"
brew "pandoc"
brew "jupyterlab"
brew "libomp"
brew "librdkafka"
brew "librsvg"
brew "libslirp"
brew "llm"
brew "marp-cli"
brew "meilisearch"
brew "minizip"
brew "muffet"
brew "tree-sitter"
brew "neovim"
brew "nkf"
brew "nvm"
brew "ollama"
brew "peco"
brew "pkg-config"
brew "pnpm"
brew "poco"
brew "poetry"
brew "poppler"
brew "portaudio"
brew "postgresql@14", restart_service: true
brew "protobuf"
brew "pwgen"
brew "python@3.10"
brew "python@3.11"
brew "rabbitmq-c"
brew "re2"
brew "rustup-init"
brew "rye"
brew "sheldon"
brew "sox"
brew "starship"
brew "tmux"
brew "trash"
brew "tree"
brew "unar"
brew "uv"
brew "wget"
brew "whisperkit-cli"
brew "yarn"
brew "yt-dlp"
brew "aljohri/-/docx2pdf"
brew "supabase/tap/supabase"
cask "1password"
cask "alacritty"
cask "cursor"
cask "discord"
cask "docker"
cask "font-plemol-jp-nf"
cask "gather"
cask "google-chrome"
cask "google-drive"
cask "keyboardcleantool"
cask "libreoffice"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "the-unarchiver"
cask "zoom"
