# Managed by scripts/brewfile-manager.py.
# Shared formulae and taps applied on both macOS and Linux.

tap "entireio/tap"
tap "schroneko/tap"
tap "xdevplatform/tap"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "ccache"
brew "cloudflared"
brew "cmake"
brew "coreutils"
brew "fastmcp"
brew "ffmpeg"
brew "flyctl"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "huggingface-cli"
brew "imagemagick"
brew "jq"
brew "libass"
brew "mupdf-tools"
brew "nasm"
brew "ncdu"
brew "neovim"
brew "ninja"
brew "nmap"
brew "oci-cli"
brew "openjdk"
brew "pdfcpu"
brew "peco"
brew "pkgconf"
brew "poppler"
brew "portaudio"
brew "presenterm"
brew "qpdf"
brew "ripgrep"
brew "schroneko/tap/castkit"
brew "ssh-copy-id"
brew "stow"
brew "syncthing", restart_service: :changed
brew "tailscale"
brew "tesseract-lang"
brew "timg"
brew "tmux"
brew "tree"
brew "uv"
brew "vercel-cli"
brew "volta"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
