tap "entireio/tap"
tap "schroneko/tap"
tap "xdevplatform/tap"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "ccache"
brew "cloudflared"
brew "cmake"
brew "container"
brew "coreutils"
brew "uv"
brew "fastmcp"
brew "ffmpeg"
brew "flyctl"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "huggingface-cli"
brew "imagemagick"
brew "jq"
brew "libass"
brew "llama.cpp"
brew "mint"
brew "mupdf-tools"
brew "nasm"
brew "ncdu"
brew "neovim"
brew "ninja"
brew "nmap"
brew "oci-cli"
brew "openclaw-cli"
brew "openjdk"
brew "pdfcpu"
brew "peco"
brew "pkgconf"
brew "poppler"
brew "portaudio"
brew "qpdf"
brew "ripgrep"
brew "ssh-copy-id"
brew "stow"
brew "syncthing", restart_service: :changed
brew "tailscale"
brew "tesseract-lang"
brew "timg"
brew "tmux"
brew "tree"
brew "volta"
brew "xcodegen"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "schroneko/tap/castkit"
cask "1password"
cask "1password-cli"
cask "antigravity"
cask "aqua-voice"
cask "arc"
cask "capcut"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "codex"
cask "codex-app"
cask "codexbar"
cask "comfyui"
cask "cursor-cli"
cask "discord"
cask "docker-desktop"
cask "entireio/tap/entire"
cask "font-plemol-jp-nf"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "homerow"
cask "iina"
cask "keycastr"
cask "lm-studio"
cask "monitorcontrol"
cask "ollama-app"
cask "rectangle"
cask "screen-studio"
cask "slack"
cask "typeless"
cask "typora"
cask "warp"
cask "xdevplatform/tap/xurl"
cask "zoom"
