# Managed by scripts/brewfile-manager.sh.
# Formulae, taps, and cross-platform casks are shared by default. Darwin-only apps and overrides live in .Brewfile.darwin.

# Shared packages
tap "k1low/tap"
tap "schroneko/tap"
brew "agent-browser"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "ccache"
brew "cloudflared", restart_service: :changed
brew "cmake"
brew "coreutils"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "git"
brew "git-lfs"
brew "glow"
brew "googleworkspace-cli"
brew "hf"
brew "imagemagick"
brew "jq"
brew "k1low/tap/mo"
brew "libass"
brew "marp-cli"
brew "mise"
brew "mupdf-tools"
brew "nasm"
brew "ncdu"
brew "neovim"
brew "ninja"
brew "nmap"
brew "oci-cli"
brew "openjdk"
brew "pdfcpu"
brew "pkgconf"
brew "poppler"
brew "portaudio"
brew "presenterm"
brew "qpdf"
brew "ripgrep"
brew "schroneko/tap/castkit"
brew "stow"
brew "syncthing", restart_service: :changed
brew "tesseract-lang"
brew "timg"
brew "tmux"
brew "tree"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password-cli@beta"

# Darwin-only packages
brew "container"
brew "mint"
brew "xcodegen"
cask "1password"
cask "antigravity"
cask "claude"
cask "cleanshot"
cask "codex-app"
cask "comfyui"
cask "cursor"
cask "discord"
cask "font-plemol-jp-nf"
cask "google-chrome"
cask "google-drive"
cask "homerow"
cask "keycastr"
cask "lm-studio"
cask "monitorcontrol"
cask "ollama-app"
cask "rectangle"
cask "screen-studio"
cask "slack"
cask "tailscale-app"
cask "telegram"
cask "zoom"

# Linux-only packages
