tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.9"
brew "cocoapods"
brew "curl"
brew "deno"
brew "exa"
brew "ffmpeg"
brew "hdf5"
brew "lima"
brew "nkf"
brew "openssl@3"
brew "pwgen"
brew "six"
brew "starship"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "zlib"
cask "appcleaner"
cask "autodesk-fusion360"
cask "blender"
cask "discord"
cask "docker"
cask "figma"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "grammarly"
cask "shiftit"
cask "slack"
cask "visual-studio-code"
cask "zoom"
