tap "homebrew/autoupdate"
tap "lihaoyun6/tap"
brew "chezmoi"
brew "cloudflared", restart_service: :changed
brew "cmake"
brew "coreutils"
brew "docker"
brew "eza"
brew "ffmpeg"
brew "flyctl"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "huggingface-cli"
brew "imagemagick"
brew "john-jumbo"
brew "jq"
brew "llama.cpp"
brew "lorem"
brew "mactop"
brew "ncdu"
brew "openjdk"
brew "peco"
brew "pgvector"
brew "poppler"
brew "portaudio"
brew "python@3.12"
brew "python@3.13"
brew "qrencode"
brew "redis"
brew "ruff"
brew "rust"
brew "rustup"
brew "ssh-copy-id"
brew "starship"
brew "tailscale"
brew "tree"
brew "tree-sitter"
brew "uv"
brew "volta"
brew "wget"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "aqua-voice"
cask "arc"
cask "azookey"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "codex"
cask "comfyui"
cask "discord"
cask "docker-desktop"
cask "font-plemol-jp-nf"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "homerow"
cask "keycastr"
cask "lm-studio"
cask "monitorcontrol"
cask "ollama-app"
cask "rectangle"
cask "slack"
cask "upscayl"
cask "zoom"
