brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "coreutils"
brew "eza"
brew "libass"
brew "ffmpeg"
brew "flyctl"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "huggingface-cli"
brew "python@3.12"
brew "imagemagick"
brew "jq"
brew "llama.cpp"
brew "mint"
brew "ncdu"
brew "neovim"
brew "openjdk"
brew "peco"
brew "pgvector"
brew "poppler"
brew "portaudio"
brew "python@3.13"
brew "ripgrep"
brew "rust"
brew "ssh-copy-id"
brew "tailscale"
brew "tree"
brew "uv"
brew "volta"
brew "xcodegen"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "aqua-voice"
cask "arc"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "codex"
cask "comfyui"
cask "discord"
cask "docker-desktop"
cask "font-plemol-jp-nf"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "homerow"
cask "iina"
cask "keycastr"
cask "lm-studio"
cask "monitorcontrol"
cask "ollama-app"
cask "rectangle"
cask "slack"
cask "zoom"
